35-3MPa-800K-100MPa/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (50 -50 0)
    (50 50 0)
    (-50 50 0)
    (-50 -50 0)
    (50 -50 120)
    (50 50 120)
    (-50 50 120)
    (-50 -50 120)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (101 101 120) simpleGrading (1 1 1)
/*	simpleGrading
	(
		(
		(0.4 0.3 0.25)
		(0.2 0.4 1)
		(0.4 0.3 4)
		)//x
		
		(
		(0.4 0.3 0.25)
		(0.2 0.4 1)
		(0.4 0.3 4)
		)//y
		
		0.25//z
	)
*/	
);

edges
(
);

patches
(
    wall walls
    (
        (2 6 5 1)
        (0 4 7 3)
        (0 1 5 4)
        (4 5 6 7)
        (7 6 2 3)
        (3 2 1 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
