35-3MPa-800K-100MPa/system/topoSetDict.3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            boxes ((-0.016 -0.016 0)(0.016 0.016 0.080)
              (-0.01 -0.01 0.080)(0.01 0.01 0.104)  
              (-0.008 -0.008 0.104)(0.008 0.008 0.120));
        }
    }
);

// ************************************************************************* //
